{
    "learn_systematically": "Учи систематически",
    "write_me": "Напиши мне",
    "light_mode": "Светлая тема",
    "dark_mode": "Темная тема",
    "app_title": "Komaroad",
    "most_extensive_roadmaps": "Большие темы",
    "specific_roadmaps": "Специфические темы",
    "math": "Математика",
    "math_desc": "Изучите математику с нуля до теории гомологии и деформации",
    "history": "История",
    "history_desc": "Развитие человечества от первых цивилизаций до наших дней",
    "coming_soon": "В разработке",
    "coming_soon_desc": "Скоро выйдет, следите за обновлениями на сайте",
    "language": "Язык",
    "react_desc": "Популярная JS библиотека для создания компонентов UI",
    "english": "Английский язык",
    "english_desc": "Специфичная карта для изучения английского языка с А1 до С1",
    "all_roadmaps": "На главную",
    "full_picture": "Полная картинка",
    "about": "О проекте",
    "terms": "Условия",
    "author": "Автор",
    "suggestions": "Предложения",
    "description": "Описание:",
    "math_text1": "Эта математическая дорожная карта может дать вам общие знания о математике, а также дать вам полное представление о математической системе. Конечно, вы не можете стать Евклидом, Гильбертом или Теренсом Тао в конце этой дорожной карты. Но если вы все сделаете правильно, я могу гарантировать, что в конце дорожной карты вы почувствуете себя более уверенно в математических вопросах и формулировки вроде этой: αν, X, Y (TX, TY) Iν, Y (TY) больше не будут для вас трудными , потому что вы можете почувствовать способность принять это и понять, что автор теории хочет нам сказать.",
    "picture_rec": "Я рекомендую скачать картинку себе (особенно если у вас мобильное устройство) и просто заполнить темы, которые вы выучили, своим любимым цветом :) НО если вы хотите разместить дорожную карту в общем доступе, пожалуйста, сделайте ссылку на оригинал, потому что все дорожные карты лицензированы!",
    "picture_desc": "(Если ваша картинка зависает при масштабировании, не волнуйтесь, просто картинка очень большая и рендеринг происходит в разных масштабах)",
    "picture_desc1": "Крутите колесиком мыши или используйте кнопки чтобы приблизить карту:",
    "appendix": "Приложение:",
    "common_appendix1": "Многие темы в этой дорожной карте могут иметь свои собственные дорожные карты, которые не намного меньше по размеру. Если у вас есть какие-либо мысли по этому поводу, напишите свои предложения, и мы вместе их рассмотрим. Возможно, вы сможете стать автором своей специфичной дорожной карты",
    "common_appendix2": "Все дорожные карты лицензированы, но я не против поделиться ими, если вы дадите ссылку на оригинал, потому что я добрый человек :)",
    "math_appendix3": "Для практики я рекомендую пройти онлайн-курс от первого до последнего класса (например, Khan Academy или любой курс раньше Infourok был неплохим, но сейчас он стал полуплатный). Это труднее, чем вы думаете",
    "math_appendix4": "По поводу книг очень сложно дать совет, но, возможно, вас заинтересует какая-нибудь научно-популярная литература. Например, «В погоне за неизвестным: 17 уравнений, изменивших мир» или «Великие математические проблемы» Яна Стюарта. Также я хочу порекомендовать вам 'Плач математика' о задачах изучения математики в школах.",
    "math_appendix5": "За научно-популярными книгами скрывается «гугол» научных статей, и их действительно сложно понять. Если вы чувствуете себя некомфортно, просто не входите в это бесконечное колесо, или вы можете получить «Gehirn Brehen» (извините, моя любимая фраза)",
    "history_text1": "Эта историческая роадмапа даст вам представление об истории как одной из самых огромных дисциплин, и это неудивительно, так как в той или иной степени, все другие науки произростают из истории человечества. Историческая наука имеет огромное количество направлений, я же хочу дать вам системную картину, которая должна усвоится у вас в голове на всю жизнь. Систематизация исторических знаний важна тем, что у большого количества людей есть определенные знания по периодам, которые им интересны, но если спросить их о событиях в истории человечества в 5 - 6 веках нашей эры или допустим 13 - 11 до нашей эры, то многим будет сложно представить политическую карту того времени, уровень развития технологий, и государства лидеры. Эта карта призвана исправить белые пятна в знаниях и систематизировать нашу историю в голове каждого человека, прошедшего карту до конца.",
    "history_appendix1": "Я стараюсь не придерживаться европоцентризма, но Европа - это огромное пятно на теле истории человечества (кстати, моя дипломная работа была посвящена синтезу европейской военной теории с азиатскими традициями и культурой)",
    "history_appendix2": "Вы должны понимать, что история действительно велика, и я не включил многие конкретные и важные темы в эту дорожную карту (например, История религии, История архитектуры и т.д.)",
    "history_appendix3": "Может это звучит странно, но я советую вам поиграть в видеоигры. Постарайтесь быть «Homo Ludens» (Гейзенберг) и учиться с удовольствием. Для этого я могу порекомендовать вам игры Paradox (да, они не идеальны для изучения истории, но очень близки к ней), такие как Hearts of Iron, Europa Universalis, Crusader Kings и т.д. Также я, конечно, рекомендую вам Civilization (попробуйте разные части), Total War (особенно их ранние игры) и многие другие исторические игры, но, по моему скромному мнению, приведенные выше стратегии являются лучшими инструментами обучения между всеми играми. (Если вам совсем не нравятся стратегии или игры, не пытайтесь заставить себя)",
    "history_appendix4": "Теперь о книгах... Самая большая проблема здесь - не утонуть в огромном количестве информации. Просто попробуйте найти ОДНУ самую большую книгу по любой теме (я рекомендую искать книги не по периодам или какому-либо региону, а по истории конкретной страны, связь их отношений со временем сформируется в вашей голове). Также проверьте обзоры на книги, многие историки предвзяты, даже не осознавая этого. Поэтому не принимайте ни одной строчки или факта в книге как точный факт.",
    "history_appendix5": "Историография... Тут нужно понимать, что сейчас много теорий обсуждают и эти споры тоже часть истории, поэтому, помимо изучения самой истории, нужно изучать историю изучения конкретного исторического факта :)",
    "further_math": "Высшая математика",
    "further_math_desc": "Высшая математика - это ряд углубленных курсов математики.",
    "react": "React",
    "react_text1": "React роадмап даёт вам представление о React-е, очень популярной библиотеке в то время, когда я пишу это описание, с помощью React power вы можете сделать много крутых вещей, например, этот сайт. Есть много библиотек, которые могут делать все, например 3D или некоторые игры. Я думаю, что если вы обнаружите эту дорожную карту, вы уже проверили официальную документацию для React и были разочарованы, да, официальная документация действительно странная, а статьи содержат некоторые рекурсивные вещи, что ж, я надеюсь, что в этой дорожной карте все будет систематически правильным, и вам понравится учиться с этим",
    "react_appendix3": "В этой дорожной карте мне действительно помогает другой сайт дорожной карты - https://roadmap.sh/",
    "react_appendix4": "Здесь вы можете найти мой репозиторий со всеми этими компонентами дерева - https://github.com/Ivan-Corporation/React-Komaroad",
    "about_1": "Я очень люблю узнавать новые темы и целые новые разделы науки и жизни, которые часто являются спецификой отдельных людей, посвятивших этому жизнь, для всех остальных это кажется чем-то обыденным, например современная математика еще со школы даёт нам чувство что какие-то гениальные люди или вообще непонятно что создало её, такое же с химией, физикой и многими другими науками.",
    "about_2": "Сначала стоит сказать обо мне, я имею высшее историческое образование и казалось бы я мог бы отдать область точных наук людям умнее себя и сидеть тихо почитывать Гомера и Геродота, но благодаря изучению истории я понял как тяжело бывает систематизировать знания и что история в полной мере даёт понимание того с кем сталиваются специалисты в более сложных науках. Приведу пример из истории, чтобы понять мою мысль, у нас есть много отдельных стран, некоторые из которых исчезли тысячелетия назад, все они взаимодействуют друг с другом, да еще и несколько отдельных культурных центров развития (зачастую границы проходили по океанам или высоким горам). Ведь также происходит и математике, хоть может и не так явно, например проблемы Гилберта решаются с помощью комбинации разделов математики, или вообще создается новый раздел, делающий систематизацию знаний в голове математиков еще запутанее.",
    "about_3": "Всё это создает кашу в голове, и как я часто наблюдаю, многие люди не могут представить временную линию развития человечества, или связь алгебры и топологии, это так называемые 'чёрные пятна' на знаниях. Такие 'чёрные пятна' существуют во всех предметах, которые человечество развевало на протяжении своего существования. Основной целью этого сайта является борьба с такими пятнами путём систематизации знаний о конкретной области и пониманием отчего происходит нечто более сложное (например гомология, комплексные числа и прочее, происходят от обычной арифметики) и отследить путь, через который прошла та или иная наука, чтобы стать великим изобретением человечества. Да и это просто весёло и приятно, вникать во что-то новое.",
    "my_table": "Мой стол:",
    "really?": "Реально?",
    "created": "Создано",
    "click_to_change": "Нажмите чтобы изменить",
    "click_to_go": "Нажмите чтобы перейти",
    "download": "Скачать"
}