{
    "learn_systematically": "Learn systematically",
    "write_me": "Write me",
    "light_mode": "Lightmode",
    "dark_mode": "Darkmode",
    "app_title": "Komaroad",
    "most_extensive_roadmaps": "Most extensive Roadmaps",
    "specific_roadmaps": "Specific Roadmaps",
    "math": "Math",
    "math_desc": "Math from arithmetic and euclidean geometry to homology and K-theory",
    "history": "History",
    "history_desc": "Development of humanity from the first civilizations to the present day",
    "coming_soon": "Coming soon",
    "coming_soon_desc": "The following roadmaps are coming soon. Check the site for updates",
    "language": "Language",
    "react_desc": "Open-source front-end JavaScript library for building UI components",
    "english": "English",
    "english_desc": "Specific roadmap for learning English language",
    "all_roadmaps": "All roadmaps",
    "full_picture": "Full picture",
    "about": "About",
    "terms": "Terms",
    "author": "Author",
    "suggestions": "Suggestions",
    "description": "Description:",
    "math_text1": "This math roadmap can give you general knowledges about mathematics and give you a full picture of math system. Of course you can't become Euclid, Hilbert or another great matimatician on the end of this roadmap. But if you will do all right i can guarantee that at the end of roadmap you will fell yourself more confident in math questions and formuls like this: αν,X,Y(TX, TY) Iν,Y(TY) not be difficult anymore, because you can feel ability to take it and understand what author of theory want to say us.",
    "picture_rec": "I recommend downloading a picture for yourself (especially if you have a mobile device) and just fill in the topics you learned with your favorite color :) BUT if you want to share the roadmap in the public domain, please link to the original, because all roadmaps licensed!",
    "picture_desc": "(If your picture freezes when scaling, don't worry, it's just that the picture is very large and the rendering takes place at different scales)",
    "picture_desc1": "Scroll the wheel or use buttons to zoom in, if you have some problems just open full picture:",
    "appendix": "Appendix:",
    "common_appendix1": "Many of the topics in this roadmap may have their own roadmaps that are not much smaller in size. If you have any thoughts on this, write your suggestions and we will consider them together. Perhaps you can become the author of your own specific roadmap",
    "common_appendix2": "All roadmaps have licensed but i don't mind share them if you will give a link on original because i kind man :)",
    "math_appendix3": "For practice, I recommend taking an online school course from first to last grade (e.g. Khan Academy or any course in your native language). It's hardest than you can think",
    "math_appendix4": "About books it's really hard to give advice but maybe you will be interested in some popular science. For example 'In Pursuit of the Unknown: 17 Equations That Changed the World' or 'The Great Mathematical Problems' by Ian Stewart. Also i want to reccomend you 'A Mathematician's Lament' that is about math studying problems in schools",
    "math_appendix5": "Behind of popular science books hiding a 'Googol' of science articles and it's really hard to understand them. If you feel yourself uncomfortable just don't go into that endless wheel or you can get 'Gehirn Brehen' (sorry, my beloved phrase)",
    "history_text1": "This history roadmap give us a view on one of the most enormous disciplines, and this is not surprising, since to one degree or another, all other sciences originate from the history of mankind. Historical science has a huge number of directions, but I want to give you a systematic picture that should be assimilated in your head for life. The systematization of historical knowledge is important because a large number of people have certain knowledge of the periods that are of interest to them, but if you ask them about events in the history of mankind in the 5-6 centuries of our era, or let's say 13-11 BC, then it will be difficult for many present a political map of the time, the level of technology development, and state leaders. This map is designed to correct white spots in knowledge and systematize our history in the head of every person who has gone through the map to the end.",
    "history_appendix1": "I try not to adhere to Eurocentrism, but Europe is a huge spot on the body of human history (by the way, my thesis was devoted to the synthesis of European military theory with Asian traditions and culture)",
    "history_appendix2": "You need understand that history it's really big, and i'm not included many specific and important themes in this roadmap (e.g. History of Religion, History of Arhitecture etc). Maybe i create roadmaps about this specific themes later",
    "history_appendix3": "Maybe it's sound strange but i advice you to play in videogames. Try to be 'Homo Ludens' (Heisenberg) and learning with pleasure. For that i can recommend you Paradox Games (yep, they are not ideal for learning history but really close to it) like Hearts of Iron, Europa Universalis, Crusader Kings etc. Also i of course recommend you Civilisation (try different parts), Total War (espesially their early games)and many other historical games, but in my humble opinion strategies above are best learning tools between all games. (If you don't like strategy or games at all, don't try to push yourself)",
    "history_appendix4": "Now about the books... The biggest problem here is not to drown in a huge amount of information. Just try to find ONE largest book on any topic (I recommend looking for books not by periods or any area, but by the history of a particular country, the connect of their relationship will form in your head over time). Also check the reviews on the books, a lot of historians are biased without realizing it. Therefore do not take any line or fact in the book as an exact fact.",
    "history_appendix5": "Historiography... Here you need to understand that many theories are now under debates and this debates it's a part of history too, therefore, in addition to studying history itself, you need to study the history of studying a specific historical fact :)",
    "further_math": "Further Mathematics",
    "further_math_desc": "Higher Mathematics it's a number of advanced secondary math course",
    "react": "React",
    "react_text1": "React roadmap it's a most important things for React library. In time when i write this description, with React power you can make a lot of cool stuff like this site for example. There are many libraries that can do everything, for example 3D or some games. I think that if you find that roadmap you already checked official docs for React and was be dissapointed, yea official docs are really strange and articles make some recursive stuff, well i hope that in this roadmap all will be systematically right and you will enjoy your study with this",
    "react_appendix3": "In this roadmap me really help another roadmap site - https://roadmap.sh/",
    "react_appendix4": "Here you can find my assist to this roadmap - https://github.com/Ivan-Corporation/React-Komaroad",
    "about_1": "I really like to learn new topics and whole new sections of science and life, which are often the specifics of individual people who have devoted their lives to this, for everyone else it seems like something commonplace, for example, modern mathematics from school gives us the feeling that some kind of brilliant people or in general it is not clear what created it, the same with chemistry, physics and many other sciences.",
    "about_2": "First, it is worth saying about me, I have a higher education in history and it would seem that I could give the field of exact sciences to people smarter than myself and sit quietly to read Homer and Herodotus, but thanks to the study of history, I realized how difficult it is to systematize knowledge and that history fully gives understanding with whom specialists in more complex sciences become. I will give an example from history to understand my idea, we have many separate countries, some of which disappeared millennia ago, they all interact with each other, and even several separate cultural centers of development (often the borders passed through oceans or high mountains). After all, mathematics also happens, although it may not be so explicit, for example, Gilbert's problems are solved using a combination of sections of mathematics, or a new section is generally created that makes the systematization of knowledge in the head of mathematicians even more confusing.",
    "about_3": "All this creates a mess in my head, and as I often observe, many people cannot imagine the timeline of human development, or the connection between algebra and topology, these are the so-called 'black spots' on knowledge. Such 'black spots' exist in all objects that humanity has waved throughout its existence, and the main goal of this site is to combat such spots by systematizing knowledge about a specific area and understanding why something more complex is happening (for example, homology, complex numbers, etc., come from ordinary arithmetic) and trace the path through which this or that science went to become the great invention of mankind. And it’s just fun and pleasant to delve into something new.",
    "my_table": "My table:",
    "really?": "Really?",
    "created": "Created",
    "click_to_change": "Click to change",
    "click_to_go": "Click to go",
    "download": "Download",
    "login": "Login",
    "register": "Register",
    "register_desc": "This auth needs you only if you want to save progress and achievements",
    "password_helper": "Password should be at least 6 characters",
    "password_helper_2": "Lets pretend that you repeated :)",
    "email_helper": "Just for posibility to save your progress",
    "profile": "Profile",
    "trophies": "Trophies",
    "settings": "Settings",
    "logout": "Logout",
    "drawer1": "Achievements",
    "drawer2": "Settings",
    "drawer3": "In Progress"
}